---
kind: type
id: T:Autodesk.Revit.DB.IFC.IFCFileModelOptions
source: html/9cd09052-e2e2-84e3-c500-9b492ad8d78b.htm
---
# Autodesk.Revit.DB.IFC.IFCFileModelOptions

This class contains options to create an IFC file model.

## Syntax (C#)
```csharp
public class IFCFileModelOptions : IDisposable
```